Repository: mike-fabian/ibus-typing-booster
Catalog: ibus-typing-booster/po/*.po
Languages: ca

source: Setup
ca: Preferències

source: Configure ibus-typing-booster “%(name)s”
ca: Preferències per a l'ibus-typing-booster “%(name)s”

source: Unknown format of engine name: IBUS_ENGINE_NAME=%(name)s
ca: Format desconegut del nom del motor: IBUS_ENGINE_NAME=%(name)s

source: IBUS_ENGINE_NAME environment variable is not set.
ca: La variable d'entorn IBUS_ENGINE_NAME no està establerta.

source: Cannot determine the config file for this engine. Please use the --config-file option.
ca: No es pot determinar cap fitxer de configuració per a aquest motor. Si us plau, utilitzeu l'opció --config-file.

source: Config file %(file)s does not exist.
ca: El fitxer de configuració %(file)s no existeix.

source: Preferences for ibus-typing-booster "%(symbol)s"
ca: Preferències per a l'ibus-typing-booster "%(symbol)s"

source: Another instance of this app is already running.
ca: Ja s'està executant una altra instància d'aquesta aplicació.

source: Open File ...
ca: Obre el fitxer...

source: Learned successfully from file %(filename)s.
ca: S'ha après correctament del fitxer %(filename)s.

source: Learning from file %(filename)s failed.
ca: Ha fallat l'aprenentatge del fitxer %(filename)s.

source: Are you sure?
ca: Esteu segur?

source: Do you really want to delete all language data learned from typing or reading files?
ca: Realment voleu eliminar totes les dades de l'idioma que s'han après de l'escriptura o la lectura de fitxers?

source: ibus is not running.
ca: ibus no s'està executant.

source: Close
ca: Tanca

source: Enable suggestions by Tab key
ca: Habilita els suggeriments amb la tecla Tab

source: Candidate window page size:
ca: Mida de la pàgina de la finestra dels candidats:

source: Input Method:
ca: Mètode d'entrada:

source: Display total number of candidates
ca: Mostra el nombre total de candidats

source: Minimum number of chars for completion:
ca: Nombre màxim de caràcter per a la conclusió:

source: Input Method Help
ca: Ajuda del mètode d'entrada

source: Options
ca: Opcions

source: Install dictionary
ca: Instal·la el diccionari

source: Install pyhunspell
ca: Instal·la pyhunspell

source: Learn from text file
ca: Aprèn del fitxer de text

source: Install the dictionary package for this engine
ca: Instal·la el paquet del diccionari per a aquest motor

source: Install pyhunspell package to get spellchecking suggestions
ca: Instal·la el paquet pyhunspell per obtenir els suggeriments de la revisió ortogràfica

source: Learn your style by reading a text file
ca: Aprèn el vostre estil amb la lectura d'un fitxer de text

source: Delete all personal language data learned from typing or from reading files
ca: Elimina totes les dades de l'idioma personal que s'han après de l'escriptura o de la lectura de fitxers

source: Delete learned data
ca: Elimina les dades que s'han après

source: Dictionaries and personal data
ca: Diccionaris i dades personals
