Repository: mike-fabian/ibus-typing-booster
Catalog: po/*.po
Languages: ru

source: Emoji Picker
ru: Выбор эмодзи

source: Emoji browsing tool
ru: Инструмент просмотра эмодзи

source: Clear recently used
ru: Очистить недавно использованные

source: About
ru: Об приложении

source: Quit
ru: Выйти

source: Search for emoji
ru: Поиск эмодзи

source: Set the font to display emoji
ru: Установить шрифт для отображения эмодзи

source: Set font size
ru: Установить размер шрифта

source: Fallback
ru: Обратный шрифт

source: Whether to use font fallback for emoji or parts of emoji sequences which cannot be displayed using the selected font.
ru: Использовать ли обратный шрифт для эмодзи или частей последовательностей эмодзи, которые не могут быть отображены с помощью выбранного шрифта.

source: Recently used
ru: Недавно использованные

source: Categories
ru: Категории

source: Unicode categories
ru: Категории Юникода

source: Keywords
ru: Ключевые слова

source: Fonts used to render this emoji:
ru: Шрифты, использованные для отображения этого эмодзи:

source: Unicode Version:
ru: Версия Юникода:

source: Emoji Version:
ru: Версия эмодзи:

source: Emoji properties:
ru: Свойства эмодзи:

source: Unicode category:
ru: Категория Юникода:

source: Unicode block:
ru: Блок Юникода:

source: Left click to copy
ru: Нажмите левую кнопку мыши, чтобы скопировать

source: Long press or middle click for skin tones
ru: Длительное нажатие или средний щелчок для выбора тонов кожи

source: Right click for info
ru: Правая кнопка мыши для показа информации

source: Search Results
ru: Результаты поиска

source: Search produced empty result.
ru: Поиск не дал никаких результатов.

source: Copied to clipboard!
ru: Скопировано в буфер обмена!

source: Lookup on emojipedia
ru: Искать в emojipedia

source: System default
ru: Системные по умолчанию

source: Set Font
ru: Установить шрифт

source: Off
ru: Выкл.

source: On
ru: Вкл.

source: Input mode
ru: Режим ввода

source: Here you can switch ibus-typing-booster on or off.
ru: Здесь вы можете включить или выключить ibus-typing-booster.

source: Unicode symbols and emoji predictions
ru: Предположения для символов Юникода и эмодзи

source: Off the record mode
ru: Выключить режим записи

source: Highest priority dictionary
ru: Словарь с наивысшим приоритетом

source: Choose highest priority dictionary
ru: Выберите словарь с наивысшим приоритетом

source: Preedit input method
ru: Метод предварительного редактирования

source: Switch preedit input method
ru: Переключение метода предварительного редактирования ввода

source: Setup
ru: Настройка

source: Preferences for ibus-typing-booster
ru: Предпочтения для ibus-typing-booster

source: Failed to import Google speech-to-text.
ru: Не удалось импортировать речь-в-текст Google.

source: Failed to import pyaudio.
ru: Не удалось импортировать pyaudio.

source: Failed to import queue.
ru: Не удалось импортировать очередь.

source: No supported language for speech recognition.
ru: Нет поддерживаемого языка для распознавания речи.

source: “Google application credentials” file “%s” not found.
ru: Файл "Учетные данные приложения Google" "%s" не найден.

source: Failed to init Google speech-to-text. See debug.log.
ru: Не удалось инициировать Google речь-в-текст. Смотрите debug.log.

source: Google speech-to-text error. See debug.log.
ru: Ошибка преобразования речи в текст Google. См. файл debug.log.

source: people
ru: люди

source: nature
ru: природа

source: food
ru: еда

source: travel
ru: путешествие

source: activity
ru: активность

source: objects
ru: объекты

source: symbols
ru: символы

source: flags
ru: флаги

source: modifier
ru: модификатор

source: regional
ru: региональный

source: Others, Miscellaneous, Various, Diverse
ru: Другие, Разные, Разнообразные, Нетипичные

source: File not found
ru: Файл не найден

source: Permission error
ru: Ошибка доступа

source: Unicode decoding error
ru: Ошибка декодирования Юникода

source: Unknown error
ru: Неизвестная ошибка

source: Native Keyboard
ru: Встроенная клавиатура

source: Direct keyboard input. This is not really an input method, it uses directly whatever comes from the current keyboard layout without any further changes. So no transliteration or composing is done here.
ru: Прямой ввод с клавиатуры. Это не совсем метод ввода, он использует напрямую все, что поступает с текущей раскладки клавиатуры, без каких-либо дополнительных изменений. Таким образом, никакой транслитерации или композиции здесь не происходит.

source: Key input
ru: Ввод клавиши

source: Cancel
ru: Отмена

source: Please press a key (or a key combination)
ru: Нажмите клавишу (или комбинацию клавиш)

source: The dialog will be closed when the key is released
ru: Диалоговое окно будет закрыто, когда клавиша будет отпущена

source: A completion input method to speedup typing.
ru: Способ ввода с автоматическим дополнением для ускорения набора текста.

source: translator-credits
ru: Ser82-png <asvmail.as@gmail.com>, 2025

source: Online documentation:
ru: Онлайн-документация:

source: Typing Booster Preferences
ru: Настройки Typing Booster

source: Set Typing Booster Options
ru: Установите параметры Typing Booster

source: Preferences
ru: Параметры

source: Restore all defaults
ru: Восстановить все настройки по умолчанию

source: _Close
ru: _Закрыть

source: Dictionaries and input methods
ru: Словари и методы ввода

source: Options
ru: Параметры

source: Custom shortcuts
ru: Пользовательские комбинации

source: Key bindings
ru: Привязки клавиш

source: Appearance
ru: Стиль отображения

source: AI
ru: ИИ

source: Speech recognition
ru: Распознавание речи

source: Autosettings
ru: Автонастройки

source: Enable suggestions by key (Default is the Tab key)
ru: Включить варианты по клавише (по умолчанию — клавиша Tab)

source: If this option is on, suggestions are not shown by default. Typing a key is then necessary to show the list of suggestions. The key to use for this can be changed in the key bindings settings. By default it is the Tab key. After a commit the suggestions are hidden again until the next key bound to this command is typed.
ru: Если отмечен этот пункт, то варианты не будут появляться. Для того чтобы появился список вариантов, вам придется нажать определенную клавишу. Эту клавишу можно изменить в настройках привязки клавиш к командам. По умолчанию это клавиша Tab. После выбора варианта список снова будет скрыт, пока вновь не будет нажата клавиша, связанная с этой командой.

source: Use inline completion
ru: Использовать встроенное завершение

source: Whether the best completion is first shown inline in the preedit instead of showing a full candidate list. The inline candidate can be selected by typing Tab and then committed as usual, for example by typing Space or Control+Space. Typing Tab again moves to the next candidate and opens the full candidate list.
ru: Сначала в предварительном редактировании отображается наилучшее завершение, а не показывается полный список кандидатов. Встроенного кандидата можно выбрать с помощью клавиши Tab, а затем зафиксировать, как обычно, например, нажав Пробел или Ctrl+Пробел. Повторное нажатие Tab перемещает вас к следующему кандидату и открывает полный список кандидатов.

source: No
ru: Нет

source: Yes, with fallback to popup
ru: Да, с возможностью возврата к всплывающему окну

source: Yes, without fallback to popup
ru: Да, без возможности появления запасного варианта

source: Auto capitalize
ru: Автоматически с заглавной буквы

source: Automatically capitalize after punctuation.
ru: Автоматически начинать с заглавной буквы после соответствующих знаков препинания.

source: Automatically select the best candidate
ru: Автоматически выбирать лучший вариант

source: What you type will automatically be corrected to the best candidate by selecting the best candidate automatically. If this option is off you have to select a candidate manually by using the key binding to select the next candidate. If this option is on and you do not want to use the automatically selected candidate, you can use the key binding for the “cancel” command which will deselect all candidates.
ru: То, что вы вводите, будет автоматически скорректировано на наилучшего кандидата путем автоматического выбора наилучшего кандидата. Если эта опция отключена, вы можете выбрать кандидата вручную, используя привязку клавиш для выбора следующего кандидата. Если эта опция включена и вы не хотите использовать автоматически выбранного кандидата, вы можете использовать привязку клавиши для команды «отмена», которая отменит выбор всех кандидатов.

source: Yes, but only when extremely likely
ru: Да, но только если вероятность очень высока

source: Yes, always
ru: Да, всегда

source: Add a space when committing by mouse click
ru: Добавлять пробел при отправке с помощью щелчка мыши

source: Add a space if a candidate from the candidate list is committed by clicking it with the mouse.
ru: Добавлять пробел, если вариант из списка был отправлен щелчком мыши.

source: Remember last used preedit input method
ru: Запоминать последний использованный способ ввода предварительного редактирования

source: If more than one input method is used at the same time, one of them is used for the preedit. Which input method is used for the preedit can be changed via the menu or via shortcut keys. If this option is enabled, such a change is remembered even if the session is restarted.
ru: Если одновременно используется более одного метода ввода, один из них используется для предварительного редактирования. Метод ввода, используемый для предварительного редактирования, можно изменить через меню или с помощью горячих клавиш. Если эта опция включена, такое изменение запоминается даже после перезапуска сеанса.

source: Remember input mode
ru: Запомнить режим ввода

source: If this option is enabled, the last used input mode (on/off) is remembered even if the session is restarted.
ru: Если эта опция включена, последний использованный режим ввода (вкл./выкл.) запоминается даже после перезапуска сеанса.

source: Word predictions
ru: Предсказания слов

source: Whether ibus-typing-booster should show word predictions.
ru: Должен ли ibus-typing-booster показывать предсказания слов.

source: Whether Unicode symbols and emoji should be included in the predictions. Emoji are pictographs like ☺♨⛵…. Unicode symbols are other symbols like mathematical symbols (∀∑∯…), arrows (←↑↔…), currency symbols (€₹₺…), braille patterns (⠥⠩…), and many other symbols. These are technically not emoji but nevertheless useful symbols.
ru: Следует ли включать символы Юникода и эмодзи в список предложений. Эмодзи — это пиктограммы, такие как ☺♨⛵…. Символы Юникода — это другие символы, такие как математические символы (∀∑∯…), стрелки (←↑↔…), символы валют (€₹₺…), шрифт Брайля (⠥⠩…) и многие другие символы. Технически это не эмодзи, но тем не менее полезные символы.

source: Emoji style
ru: Стиль эмодзи

source: To select between colorful emoji (emoji style), monochrome emoji (text style), or no style preference.
ru: Для выбора между цветными эмодзи (стиль эмодзи), монохромными эмодзи (стиль текста) или без предпочтения по стилю.

source: Emoji
ru: Эмодзи

source: Text
ru: Текст

source: No style
ru: Без стиля

source: While “Off the record” mode is on, learning from user input is disabled. If learned user input is available, predictions are usually much better than predictions using only dictionaries. Therefore, one should use this option sparingly. Only if one wants to avoid saving secret user input to disk it might make sense to use this option temporarily.
ru: Когда включен режим "Без записи", обучение на основе ввода пользователя отключено. Если доступны данные, полученные в результате обучения, предсказания обычно намного лучше, чем предсказания, основанные только на словарях. Поэтому следует использовать эту опцию экономно. Использовать эту опцию временно имеет смысл только в том случае, если вы хотите избежать сохранения конфиденциального пользовательского ввода на диск.

source: Record mode
ru: Режим записи

source: Selects which kind of input should be recorded in the user database: “Everything”: Every typed word is added to the user database or its frequency updated if it is already there. “Correctly spelled or previously recorded”: A typed word is only added to the user database if it is likely to be correctly spelled. If a word is already in the user database its frequency is updated no matter how it is spelled. “Correctly spelled”: A typed word is only added to the database or its frequency updated in the database if it is likely to be correctly spelled. “Nothing”: Do not record any input at all in the user database.
ru: Выбирает, какой тип ввода должен записываться в пользовательскую базу данных: «Все»: каждое введенное слово добавляется в пользовательскую базу данных или обновляется его частота, если оно там уже есть. «Правильно написанное или ранее записанное»: введенное слово добавляется в пользовательскую базу данных только в том случае, если оно, скорее всего, написано правильно. Если слово уже есть в пользовательской базе данных, его частота обновляется независимо от того, как оно написано. «Правильно написано»: введенное слово добавляется в базу данных или обновляется его частота в базе данных только в том случае, если оно, скорее всего, написано правильно. «Ничего»: вообще не записывать никакой ввод в пользовательскую базу данных.

source: Everything
ru: Все

source: Correctly spelled or previously recorded
ru: Правильно написанное или ранее записанное

source: Correctly spelled
ru: Правильно написано

source: Nothing
ru: Ничего

source: Avoid using the %s function
ru: Избегайте использования функции %s

source: Use a workaround if the %s function is broken. Enable this option only if absolutely necessary, it can also cause problems, especially when XIM is used.
ru: Используйте обходной путь, если функция %s не работает. Включайте эту опцию только в случае крайней необходимости, так как она может вызвать проблемы, особенно при использовании XIM.

source: Enable reopening preedits
ru: Разрешить повторное открытие предредактирования

source: Whether it is allowed to put a word back into a preedit when the cursor moves to the end or the beginning of a word. Enabling this option is useful to correct already committed words.
ru: Разрешить возвращение слова в предварительное редактирование, когда курсор перемещается в конец или начало слова. Включение этой опции полезно для исправления уже зафиксированных слов.

source: Disable in terminals
ru: Отключить в терминалах

source: Whether ibus-typing-booster should be disabled in terminals.
ru: Отключить ли ibus-typing-booster в терминалах.

source: Convert language specific digits to ASCII digits
ru: Преобразовывать специфичные для языка цифры в цифры ASCII

source: Some input methods produce language specific digits by default. If one never wants to use such language specific digits but prefers western (ASCII) digits always, one can set this option to convert language specific digits produced by input methods always to ASCII digits.
ru: Некоторые методы ввода по умолчанию создают специфичные для языка цифры. Если вы никогда не хотите использовать такие специфичные для языка цифры, а всегда предпочитаете западные (ASCII) цифры, вы можете установить эту опцию для преобразования специфичных для языка цифр, создаваемых методами ввода, всегда в цифры ASCII.

source: Use IBus keymap
ru: Использовать раскладку IBus

source: Whether the use of an IBus keymap is forced while Typing Booster is active. For most users not using an IBus keymap is recommended. In that case, the keyboard layout which was active before switching to typing booster is used.
ru: Принудительно ли использовать раскладку IBus, пока активен Typing Booster. Для большинства пользователей рекомендуется не использовать раскладку IBus. В этом случае используется раскладка клавиатуры, которая была активна до переключения на Typing Booster.

source: The ibus keymap to use when forcing an IBus keymap while Typing Booster is active.
ru: Раскладка IBus, которая будет использоваться при принудительном использовании раскладки IBus во время работы Typing Booster.

source: English
ru: Английский

source: Emoji trigger characters:
ru: Символы-триггеры эмодзи:

source: The characters in this list trigger an emoji and Unicode symbol lookup even if the option “Unicode symbols and emoji predictions” is off.
ru: Символы в этом списке запускают поиск эмодзи и символов Юникода, даже если опция «Предположения для символов Юникода и эмодзи» отключена.

source: Auto commit characters:
ru: Символы автоматической фиксации:

source: The characters in this list cause the preedit to be committed automatically, followed by a space. For example, if “.” is an auto commit character, this saves you typing a space manually after the end of a sentence. You can freely edit this list, a reasonable value might be “.,;:?!)”. You should not add characters to that list which are needed by your input method, for example if you use Latin-Pre (t-latn-pre) it would be a bad idea to add “.” to that list because it would prevent you from typing “.s” to get “ṡ”. You can also disable this feature completely by making the list empty (which is the default).
ru: Символы в этом списке приводят к автоматической фиксации предварительного редактирования с последующим пробелом. Например, если «.» является символом автоматической фиксации, это избавляет вас от необходимости вручную вводить пробел после конца предложения. Вы можете свободно редактировать этот список, разумным значением может быть «.,;:?!)». Вы не должны добавлять в этот список символы, необходимые вашему методу ввода, например, если вы используете Latin-Pre (t-latn-pre), было бы плохой идеей добавлять «.» в этот список, так как это помешает вам ввести «.s», чтобы получить «ṡ». Вы также можете полностью отключить эту функцию, сделав список пустым (что является значением по умолчанию).

source: Minimum number of chars for completion:
ru: Минимальное количество символов для автозавершения:

source: Show no suggestions when less than this number of characters have been typed.
ru: Не показывать варианты, если количество введенных символов меньше указанного.

source: Play sound file on error
ru: При возникновении ошибки воспроизвести звуковой файл

source: Here you can choose whether a sound file is played if an error occurs.
ru: Здесь можно определить, будет ли программа воспроизводить звуковой файл при возникновении ошибки.

source: Debug level:
ru: Уровень отладки:

source: When greater than 0, debug information may be printed to the log file and debug information may also be shown graphically.
ru: Если значение больше 0, отладочная информация может быть выведена в файл журнала, а также отображена графически.

source: Learn from text file
ru: Изучить из текстового файла

source: Learn your style by reading a text file
ru: Выучить ваш стиль путем чтения текстового файла

source: Delete learned data
ru: Удалить полученные данные

source: Delete all personal language data learned from typing or from reading files
ru: Удалить все личные языковые данные, полученные при наборе текста или чтении файлов

source: Use dictionaries for the following languages:
ru: Использовать словари для следующих языков:

source: Add a dictionary
ru: Добавить словарь

source: Remove a dictionary
ru: Удалить словарь

source: Move dictionary up
ru: Переместить словарь выше

source: Move dictionary down
ru: Переместить словарь ниже

source: Install missing dictionaries
ru: Установить отсутствующие словари

source: Install the dictionaries which are setup here but not installed
ru: Установить словари, которые настроены здесь, но не установлены

source: Set to default
ru: Установить по умолчанию

source: Set dictionaries to the default for the current locale.
ru: Установите типовые словари для текущей локали.

source: Use the following input methods:
ru: Используйте следующие методы ввода:

source: Add an input method
ru: Добавить метод ввода

source: Remove an input method
ru: Удалить метод ввода

source: Move input method up
ru: Переместить метод ввода выше

source: Move input method down
ru: Переместить метод ввода ниже

source: Input Method Help
ru: Справка по методу ввода

source: Display some help showing how to use the input method selected above.
ru: Показать справку по использованию выбранного метода ввода.

source: Options for the input method selected above.
ru: Параметры выбранного выше способа ввода.

source: Set input methods to the default for the current locale.
ru: Установить типовые методы ввода для текущей локали.

source: Enter shortcut here:
ru: Введите комбинацию:

source: Enter shortcut expansion here:
ru: Введите расширение комбинации:

source: Clear input
ru: Очистить ввод

source: Delete shortcut
ru: Удалить комбинацию

source: Add shortcut
ru: Добавить комбинацию

source: Shortcut
ru: Комбинация клавиш

source: Shortcut expansion
ru: Расширение комбинации

source: Current key bindings:
ru: Текущие привязки клавиш:

source: Command
ru: Команда

source: Edit
ru: Редактировать

source: Edit the key bindings for the selected command
ru: Редактировать привязки клавиш для выбранной команды

source: Set default key bindings for the selected command
ru: Установить привязку клавиш по умолчанию для выбранной команды

source: Set all to default
ru: Установить все по умолчанию

source: Set default key bindings for all commands
ru: Установить привязки клавиш по умолчанию для всех команд

source: Display total number of candidates
ru: Показывать общее количество кандидатов

source: Display how many candidates there are and which one is selected on top of the list of candidates.
ru: Показывать, сколько всего кандидатов и какой из них выбран, над списком кандидатов.

source: Show status info in auxiliary text
ru: Показывать информацию о состоянии во вспомогательном тексте

source: Show in the auxiliary text whether “Emoji prediction” mode and “Off the record” mode are on or off and show which input method is currently used for the preedit. The auxiliary text is an optional line of text displayed above the candidate list.
ru: Показывать во вспомогательном тексте, включен или выключен режим «Предсказание эмодзи» и режим «Без записи», а также показывать, какой метод ввода в данный момент используется для предварительного редактирования. Вспомогательный текст — это дополнительная строка текста, отображаемая над списком кандидатов.

source: Candidate window page size:
ru: Размер страницы окна кандидатов:

source: How many suggestion candidates to show in one page of the candidate list.
ru: Сколько предложенных кандидатов показывать на одной странице списка кандидатов.

source: Candidate window orientation
ru: Ориентация окна кандидатов

source: Whether the candidate window should be drawn horizontally or vertically.
ru: Должно ли окно кандидатов отображаться горизонтально или вертикально.

source: Horizontal
ru: Горизонтальная

source: Vertical
ru: Вертикальная

source: Candidate window delay in milliseconds:
ru: Задержка окна кандидатов в миллисекундах:

source: How long to wait after the last key press before candidates are displayed.
ru: Сколько ждать после последнего нажатия клавиши, прежде чем отображать кандидатов.

source: Preedit underline
ru: Подчеркивание предредактирования

source: Which style of underlining to use for the preedit.
ru: Какой стиль подчеркивания использовать для предварительного редактирования.

source: None
ru: Отсутствует

source: Single
ru: Одинарное

source: Double
ru: Двойное

source: Low
ru: Нижнее

source: Use preedit style only if lookup is enabled
ru: Использовать стиль предредактирования только если поиск включен
