Repository: mike-fabian/ibus-typing-booster
Catalog: po/*.po
Languages: ru

source: If this option is on, a preedit style like underlining will only be used if lookup is enabled. The lookup can be disabled because one uses the option to enable lookup only when a key is pressed or because one uses the option to require a minimum number of characters before a lookup is done.
ru: Если эта опция включена, стиль предварительного редактирования, например подчеркивание, будет использоваться только если включен поиск. Поиск может быть отключен, потому что используется опция включения поиска только при нажатии клавиши или потому что используется опция требования минимального количества символов перед выполнением поиска.

source: Preedit spellchecking
ru: Проверка орфографии в предредактировании

source: Here you can choose whether spellchecking is done on the contents of the preedit and a custom color is used to indicate when the preedit might contain a spelling error.
ru: Здесь вы можете выбрать, следует ли выполнять проверку орфографии содержимого предварительного редактирования и использовать пользовательский цвет для обозначения того, что предварительное редактирование может содержать орфографическую ошибку.

source: Choose color for preedit spellchecking
ru: Выбрать цвет для проверки орфографии в предредактировании

source: Here you can specify which color to use for the preedit when the preedit might contain a spelling error. This setting only has an effect if the preedit spellchecking is enabled.
ru: Здесь вы можете указать, какой цвет использовать для предварительного редактирования, когда оно может содержать орфографическую ошибку. Этот параметр действует только в том случае, если включена проверка орфографии в предварительном редактировании.

source: Use color for inline completion
ru: Использовать цвет для встроенного завершения

source: Here you can choose whether a custom color is used for a suggestion shown inline.
ru: Здесь вы можете выбрать, следует ли использовать пользовательский цвет для предложения, показанного в строке.

source: Choose color for inline completion
ru: Выбрать цвет для встроенного завершения

source: Here you can specify which color to use for inline completion. This setting only has an effect if the use of color for inline completion is enabled and inline completion is enabled.
ru: Здесь вы можете указать, какой цвет использовать для встроенного завершения. Этот параметр действует только в том случае, если включено использование цвета для встроенного завершения и само встроенное завершение включено.

source: Use color for compose preview
ru: Использовать цвет для предпросмотра композиции

source: Here you can choose whether a custom color is used for the compose preview.
ru: Здесь вы можете выбрать, следует ли использовать пользовательский цвет для предварительного просмотра композиции.

source: Choose color for compose preview
ru: Выбрать цвет для предпросмотра композиции

source: Here you can specify which color to use for the compose preview.
ru: Здесь вы можете указать, какой цвет использовать для предварительного просмотра композиции.

source: Use color for m17n preedit
ru: Использовать цвет для предредактирования m17n

source: Here you can choose whether a custom color is used for the m17n preedit.
ru: Здесь вы можете выбрать, следует ли использовать пользовательский цвет для предварительного редактирования m17n.

source: Choose color for m17n preedit
ru: Выберите цвет для предредактирования m17n

source: Here you can specify which color to use for the m17n preedit.
ru: Здесь вы можете указать, какой цвет использовать для предварительного редактирования m17n.

source: Use color for user database suggestions
ru: Использовать цвет для предложений из пользовательской базы данных

source: Here you can choose whether a custom color is used for candidates in the lookup table which come from the user database.
ru: Здесь вы можете выбрать, следует ли использовать пользовательский цвет для кандидатов в таблице поиска, которые поступают из пользовательской базы данных.

source: Choose color for user database suggestions
ru: Выбрать цвет для предложений из пользовательской базы данных

source: Here you can specify which color to use for candidates in the lookup table which come from the user database. This setting only has an effect if the use of color for candidates from the user database is enabled.
ru: Здесь вы можете указать, какой цвет использовать для кандидатов в таблице поиска, которые поступают из пользовательской базы данных. Этот параметр действует только в том случае, если включено использование цвета для кандидатов из пользовательской базы данных.

source: Use color for spellchecking suggestions
ru: Используйте цвет для подсказок по проверке орфографии

source: Here you can choose whether a custom color is used for candidates in the lookup table which come from spellchecking.
ru: Здесь вы можете выбрать, будет ли использоваться пользовательский цвет для кандидатов в таблице поиска, полученной в результате проверки орфографии.

source: Choose color for spellchecking suggestions
ru: Выберите цвет для подсказок по правописанию

source: Here you can specify which color to use for candidates in the lookup table which come from spellchecking. This setting only has an effect if the use of color for candidates from spellchecking is enabled.
ru: Здесь вы можете указать, какой цвет использовать для кандидатов в таблице поиска, полученных в результате проверки орфографии. Эта настройка действует только в том случае, если включена функция использования цвета для кандидатов в результате проверки орфографии.

source: Use color for dictionary suggestions
ru: Используйте цвет для указания словаря

source: Here you can choose whether a custom color is used for candidates in the lookup table which come from a dictionary.
ru: Здесь вы можете выбрать, будет ли использоваться пользовательский цвет для кандидатов в таблице поиска, которые взяты из словаря.

source: Choose color for dictionary suggestions
ru: Выберите цвет для предложений по словарю

source: Here you can specify which color to use for candidates in the lookup table which come from a dictionary. This setting only has an effect if the use of color for candidates from a dictionary is enabled.
ru: Здесь вы можете указать, какой цвет использовать для кандидатов в таблице поиска, которые поступают из словаря. Этот параметр действует только в том случае, если включено использование цвета для кандидатов из словаря.

source: Use label for user database suggestions
ru: Использовать метку для предложений из пользовательской базы данных

source: Here you can choose whether a label is used for candidates in the lookup table which come from the user database.
ru: Здесь вы можете выбрать, следует ли использовать метку для кандидатов в таблице поиска, которые поступают из пользовательской базы данных.

source: Here you can specify which label to use for candidates in the lookup table which come from the user database. This setting only has an effect if the use of a label for candidates from the user database is enabled.
ru: Здесь вы можете указать, какую метку использовать для кандидатов в таблице поиска, которые поступают из пользовательской базы данных. Этот параметр действуеттолько в том случае, если включено использование метки для кандидатов из пользовательской базы данных.

source: Use label for spellchecking suggestions
ru: Использовать метку для предложений проверки орфографии

source: Here you can choose whether a label is used for candidates in the lookup table which come from spellchecking.
ru: Здесь вы можете выбрать, будет ли использоваться метка для кандидатов в таблице поиска, полученных в результате проверки орфографии.

source: Here you can specify which label to use for candidates in the lookup table which come from spellchecking. This setting only has an effect if the use of a label for candidates from spellchecking is enabled.
ru: Здесь вы можете указать, какую метку использовать для кандидатов в таблице поиска, которые поступают из проверки орфографии. Этот параметр действует только в том случае, если включено использование метки для кандидатов из проверки орфографии.

source: Use label for dictionary suggestions
ru: Использовать метку для предложений из словаря

source: Here you can choose whether a label is used for candidates in the lookup table which come from a dictionary.
ru: Здесь вы можете выбрать, следует ли использовать метку для кандидатов в таблице поиска, которые поступают из словаря.

source: Here you can specify which label to use for candidates in the lookup table which come from a dictionary. This setting only has an effect if the use of a label for candidates from a dictionary is enabled.
ru: Здесь вы можете указать, какую метку использовать для кандидатов в таблице поиска, которые поступают из словаря. Этот параметр действует только в том случае, если включено использование метки для кандидатов из словаря.

source: Use flags for dictionary suggestions
ru: Использовать флаги для предложений из словаря

source: Here you can choose whether flags are used for candidates in the lookup table which come from a dictionary.
ru: Здесь вы можете выбрать, следует ли использовать флаги для кандидатов в таблице поиска, которые поступают из словаря.

source: Use a label to indicate busy state
ru: Использовать метку для индикации занятости

source: Here you can choose whether a label is used to indicate when ibus-typing-booster is busy.
ru: Здесь вы можете выбрать, будет ли использоваться метка для индикации занятости ibus-typing-booster.

source: Here you can specify which label is used to indicate when ibus-typing-booster is busy.
ru: Здесь вы можете выбрать, какая метка будет использоваться для индикации занятости ibus-typing-booster.

source: Symbol for "enabled" mode
ru: Символ для режима "включено"

source: The symbol displayed when Typing Booster is active (transliterating input, suggesting completions, spellchecking, etc.).
ru: Символ, отображаемый при активации функции «Ускоритель ввода» (транслитерация, предложение вариантов, проверка орфографии и т. д.).

source: Symbol for "disabled" (Direct Input) mode
ru: Символ для режима "выключено" (прямой ввод)

source: The symbol displayed when Typing Booster is disabled (input is passed through directly without processing).
ru: Символ, отображаемый при отключении функции «Ускоритель ввода» (ввод данных осуществляется напрямую без обработки).

source: Enable AI chat
ru: Включить чат ИИ

source: Enable or disable AI chat globally. When disabled, all AI chat related features and keybindings are turned off.
ru: Включить или отключить чат с ИИ на глобальном уровне. При отключении все функции и комбинации клавиш, связанные с чатом ИИ, будут отключены.

source: AI server:
ru: Сервер ИИ:

source: Connection status to the AI server.
ru: Состояние соединения с сервером ИИ.

source: Model:
ru: Модель:

source: Message history limit:
ru: Ограничение журнала сообщений:

source: AI system message:
ru: Системное сообщение ИИ:

source: System prompt that guides how the AI responds.
ru: Системная инструкция (System prompt), определяющая поведение ИИ.

source: Set “Google application credentials” .json file:
ru: Указать файл .json «Учетные данные приложения Google»:

source: Full path of the “Google application credentials” .json file.
ru: Полный путь к файлу .json «Учетные данные приложения Google».

source: File not yet set.
ru: Файл ещё не установлен.

source: Add an autosetting
ru: Добавить автонастройку

source: Remove an autosetting
ru: Удалить автонастройку

source: Move an autosetting up
ru: Переместить автонастройку вверх

source: Move an autosetting down
ru: Переместить автонастройку вниз

source: Spell checking
ru: Проверка орфографии

source: Setting
ru: Настройки

source: Value
ru: Значение

source: Regular expression
ru: Регулярное выражение

source: Are you sure?
ru: Вы уверены?

source: _Cancel
ru: _Отменить

source: _OK
ru: _ОК

source: Do you really want to restore all default settings?
ru: Вы действительно хотите восстановить все настройки до значений, установленных по умолчанию?

source: Select .wav sound file:
ru: Выбрать звуковой файл .wav:

source: Add dictionary
ru: Добавить словарь

source: Add input method
ru: Добавить метод ввода

source: Variable
ru: Переменная

source: Edit key bindings for command “%s”
ru: Изменить привязку клавиш для команды «%s»

source: Add a key binding
ru: Добавить привязку клавиш

source: Remove selected key binding
ru: Удалить выбранную привязку клавиш

source: Do you really want to set the key bindings for all commands to their defaults?
ru: Вы действительно хотите установить для всех команд привязки клавиш, установленные по умолчанию?

source: Open File ...
ru: Открыть файл ...

source: Learned successfully from file %(filename)s.
ru: Успешно извлечено из файла %(filename)s.

source: Learning from file %(filename)s failed.
ru: Попытка обучения из файла %(filename)s потерпела неудачу.

source: Do you really want to delete all language data learned from typing or reading files?
ru: Вы действительно хотите удалить все языковые данные, полученные в результате набора текста или чтения файлов?

source: ibus is not running.
ru: ibus не запущено.

source: Emoji Picker is an emoji browsing tool which uses the emoji matching code from Ibus-typing-booster.
ru: Выбор эмодзи — это инструмент для просмотра эмодзи, который использует код сопоставления эмодзи из Ibus-typing-booster.

source: Typing Booster
ru: Ускоритель ввода

source: Predictive input method
ru: Метод предиктивного ввода

source: Ibus-typing-booster is a predictive input method and predicts complete words based on context and partial input. One can then simply select the desired word from a list of suggestions and improve one’s typing speed and spelling.
ru: Ibus-typing-booster — способ предиктивного ввода, определяющий полную форму частично введённых слов по контексту. Вы можете просто выбрать желаемое слово из списка предложений, что бы ускорить ввод текста и улучшить его качество.
